```bash
make tf-plan-pipeline MISSION=swxsoc_pipeline ENV=dev                                                                                     2 ✘  took 10s  sdc_aws_architecture Py  at 03:18:05 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Reusing previous version of hashicorp/random from the dependency lock file
- Reusing previous version of cyrilgdn/postgresql from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/random v3.5.1
- Using previously-installed cyrilgdn/postgresql v1.22.0
- Using previously-installed hashicorp/aws v5.96.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.aws_vpc.default: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=351967858401]
data.aws_vpc.default: Read complete after 1s [id=vpc-053871f23a6d6b927]
data.aws_subnets.public_subnets: Reading...
data.aws_subnets.public_subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.public_subnet["subnet-04d028607fe416de4"]: Reading...
data.aws_subnet.public_subnet["subnet-0071a92843e84e928"]: Reading...
data.aws_subnet.public_subnet["subnet-0af44861f3c09a119"]: Reading...
data.aws_subnet.public_subnet["subnet-09ec80d9b86868994"]: Reading...
data.aws_subnet.public_subnet["subnet-07338f669851147cb"]: Reading...
data.aws_subnet.public_subnet["subnet-0e24325c69b9a1f74"]: Reading...
data.aws_subnet.public_subnet["subnet-007da12524569b5c8"]: Reading...
data.aws_subnet.public_subnet["subnet-0972d4965ef8eb1e8"]: Reading...
data.aws_subnet.public_subnet["subnet-0af44861f3c09a119"]: Read complete after 0s [id=subnet-0af44861f3c09a119]
data.aws_subnet.public_subnet["subnet-007da12524569b5c8"]: Read complete after 1s [id=subnet-007da12524569b5c8]
data.aws_subnet.public_subnet["subnet-0071a92843e84e928"]: Read complete after 1s [id=subnet-0071a92843e84e928]
data.aws_subnet.public_subnet["subnet-04d028607fe416de4"]: Read complete after 1s [id=subnet-04d028607fe416de4]
data.aws_subnet.public_subnet["subnet-0972d4965ef8eb1e8"]: Read complete after 1s [id=subnet-0972d4965ef8eb1e8]
data.aws_subnet.public_subnet["subnet-07338f669851147cb"]: Read complete after 1s [id=subnet-07338f669851147cb]
data.aws_subnet.public_subnet["subnet-0e24325c69b9a1f74"]: Read complete after 1s [id=subnet-0e24325c69b9a1f74]
data.aws_subnet.public_subnet["subnet-09ec80d9b86868994"]: Read complete after 1s [id=subnet-09ec80d9b86868994]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.lambda_schedule will be created
  + resource "aws_cloudwatch_event_rule" "lambda_schedule" {
      + arn                 = (known after apply)
      + description         = "CloudWatch event trigger for the AWS Sorting Lambda, runs every hour"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev-swxsoc_pipeline_sdc_aws_sorting_lambda_function-rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 0/12 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "dev-swxsoc_pipeline_sdc_aws_sorting_lambda_function-rule"
      + target_id      = "DevelopmentSWXSOC_PIPELINELambdaTarget"
    }

  # aws_db_instance.rds_instance will be created
  + resource "aws_db_instance" "rds_instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 30
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "dev_swxsoc_pipeline_db"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "14.12"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.postgres14"
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all                              = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + timezone                              = (known after apply)
      + username                              = "cdftracker_user"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_ecr_repository.artifacts_function_private_ecr will be created
  + resource "aws_ecr_repository" "artifacts_function_private_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "dev-swxsoc_pipeline_sdc_aws_artifacts_lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
    }

  # aws_ecr_repository.processing_function_private_ecr will be created
  + resource "aws_ecr_repository" "processing_function_private_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "dev-swxsoc_pipeline_sdc_aws_processing_lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
    }

  # aws_ecr_repository.sorting_function_private_ecr will be created
  + resource "aws_ecr_repository" "sorting_function_private_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "dev-swxsoc_pipeline_sdc_aws_sorting_lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
    }

  # aws_ecrpublic_repository.docker_base_public_ecr will be created
  + resource "aws_ecrpublic_repository" "docker_base_public_ecr" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + registry_id     = (known after apply)
      + repository_name = "dev-swxsoc-pipeline-docker-lambda-base"
      + repository_uri  = (known after apply)
      + tags            = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all        = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
    }

  # aws_iam_policy.lambda_kms_policy will be created
  + resource "aws_iam_policy" "lambda_kms_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "dev-swxsoc_pipeline_lambda_kms_policy_"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.lambda_secrets_manager_policy will be created
  + resource "aws_iam_policy" "lambda_secrets_manager_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "dev-_swxsoc_pipeline_lambda_secrets_manager_policy_"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.lambda_vpc_access_policy will be created
  + resource "aws_iam_policy" "lambda_vpc_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Custom policy for Lambda VPC access"
      + id               = (known after apply)
      + name             = "dev-swxsoc_pipeline_lambda_vpc_access_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeSubnets",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:AssignPrivateIpAddresses",
                          + "ec2:UnassignPrivateIpAddresses",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.logs_access_policy will be created
  + resource "aws_iam_policy" "logs_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Provides access to CloudWatch Logs"
      + id               = (known after apply)
      + name             = "DevelopmentSWXSOC_PIPELINELogsAccessPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.pf_lambda_self_invoke_policy will be created
  + resource "aws_iam_policy" "pf_lambda_self_invoke_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-swxsoc_pipeline_self_invoke"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.s3_bucket_access_policy will be created
  + resource "aws_iam_policy" "s3_bucket_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Provides access to specific S3 buckets"
      + id               = (known after apply)
      + name             = "DevelopmentSWXSOC_PIPELINES3BucketAccessPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:Abort*",
                          + "s3:DeleteObject*",
                          + "s3:GetBucket*",
                          + "s3:GetObject*",
                          + "s3:List*",
                          + "s3:PutObject",
                          + "s3:PutObjectLegalHold",
                          + "s3:PutObjectRetention",
                          + "s3:PutObjectTagging",
                          + "s3:PutObjectVersionTagging",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::dev-swxsoc-pipeline-incoming",
                          + "arn:aws:s3:::dev-swxsoc-pipeline-reach",
                          + "arn:aws:s3:::dev-swxsoc-pipeline-incoming/*",
                          + "arn:aws:s3:::dev-swxsoc-pipeline-reach/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.timestream_policy will be created
  + resource "aws_iam_policy" "timestream_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Provides access to Timestream"
      + id               = (known after apply)
      + name             = "DevelopmentSWXSOC_PIPELINETimestreamAccessPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "timestream:WriteRecords",
                          + "timestream:DescribeEndpoints",
                          + "timestream:DescribeDatabase",
                          + "timestream:DescribeTable",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.artifacts_lambda_exec will be created
  + resource "aws_iam_role" "artifacts_lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-SWXSOC_PIPELINE_artifacts_lambda_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.processing_lambda_exec will be created
  + resource "aws_iam_role" "processing_lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-swxsoc_pipeline_processing_lambda_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.sorting_lambda_exec will be created
  + resource "aws_iam_role" "sorting_lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-swxsoc_pipeline_sorting_lambda_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.af_lambda_kms_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "af_lambda_kms_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-SWXSOC_PIPELINE_artifacts_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.af_logs_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "af_logs_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-SWXSOC_PIPELINE_artifacts_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.af_s3_bucket_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "af_s3_bucket_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-SWXSOC_PIPELINE_artifacts_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.af_secrets_manager_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "af_secrets_manager_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-SWXSOC_PIPELINE_artifacts_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.af_timestream_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "af_timestream_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-SWXSOC_PIPELINE_artifacts_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.af_vpc_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "af_vpc_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-SWXSOC_PIPELINE_artifacts_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.pf_lambda_kms_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "pf_lambda_kms_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_processing_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.pf_logs_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "pf_logs_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_processing_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.pf_s3_bucket_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "pf_s3_bucket_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_processing_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.pf_secrets_manager_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "pf_secrets_manager_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_processing_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.pf_self_invoke_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "pf_self_invoke_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_processing_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.pf_timestream_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "pf_timestream_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_processing_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.pf_vpc_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "pf_vpc_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_processing_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.sf_logs_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "sf_logs_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_sorting_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.sf_s3_bucket_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "sf_s3_bucket_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_sorting_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.sf_timestream_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "sf_timestream_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_sorting_lambda_exec_role"
    }

  # aws_iam_role_policy_attachment.sf_vpc_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "sf_vpc_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-swxsoc_pipeline_sorting_lambda_exec_role"
    }

  # aws_kms_key.default will be created
  + resource "aws_kms_key" "default" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for RDS"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all                           = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
    }

  # aws_lambda_function.aws_sdc_artifacts_lambda_function will be created
  + resource "aws_lambda_function" "aws_sdc_artifacts_lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "dev-swxsoc_pipeline_sdc_aws_artifacts_lambda_function"
      + id                             = (known after apply)
      + image_uri                      = "public.ecr.aws/lambda/python:3.11"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all                       = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 2048
        }

      + logging_config (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = [
              + "subnet-0972d4965ef8eb1e8",
              + "subnet-0e24325c69b9a1f74",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.aws_sdc_processing_lambda_function will be created
  + resource "aws_lambda_function" "aws_sdc_processing_lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "dev-swxsoc_pipeline_sdc_aws_processing_lambda_function"
      + id                             = (known after apply)
      + image_uri                      = "public.ecr.aws/lambda/python:3.11"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 8192
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all                       = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 2048
        }

      + logging_config (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = [
              + "subnet-0972d4965ef8eb1e8",
              + "subnet-0e24325c69b9a1f74",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.sorting_lambda_function will be created
  + resource "aws_lambda_function" "sorting_lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "dev-swxsoc_pipeline_sdc_aws_sorting_lambda_function"
      + id                             = (known after apply)
      + image_uri                      = "public.ecr.aws/lambda/python:3.11"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all                       = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + timeout                        = 600
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LAMBDA_ENVIRONMENT"     = "DEVELOPMENT"
              + "SDC_AWS_SLACK_CHANNEL"  = (sensitive value)
              + "SDC_AWS_SLACK_TOKEN"    = (sensitive value)
              + "SPACEPY"                = "/tmp"
              + "SUNPY_CONFIGDIR"        = "/tmp"
              + "SUNPY_DOWNLOADDIR"      = "/tmp"
              + "SWXSOC_INCOMING_BUCKET" = "swxsoc-pipeline-incoming"
              + "SWXSOC_MISSION"         = "swxsoc_pipeline"
            }
        }

      + ephemeral_storage {
          + size = 2048
        }

      + logging_config (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.af_allow_instrument_buckets["swxsoc-pipeline-reach"] will be created
  + resource "aws_lambda_permission" "af_allow_instrument_buckets" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-swxsoc_pipeline_sdc_aws_artifacts_lambda_function"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "PFDevelopmentSWXSOC_PIPELINEAllowExecutionFromS3Bucket-swxsoc-pipeline-reach"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.af_allow_sns_topic["swxsoc-pipeline-reach"] will be created
  + resource "aws_lambda_permission" "af_allow_sns_topic" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-swxsoc_pipeline_sdc_aws_artifacts_lambda_function"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "PFDevelopmentSWXSOC_PIPELINEAllowExecutionFromSNSTopic-swxsoc-pipeline-reach"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.pf_allow_instrument_buckets["swxsoc-pipeline-reach"] will be created
  + resource "aws_lambda_permission" "pf_allow_instrument_buckets" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-swxsoc_pipeline_sdc_aws_processing_lambda_function"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "PFDevelopmentSWXSOC_PIPELINEAllowExecutionFromS3Bucket-swxsoc-pipeline-reach"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.pf_allow_sns_topic["swxsoc-pipeline-reach"] will be created
  + resource "aws_lambda_permission" "pf_allow_sns_topic" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-swxsoc_pipeline_sdc_aws_processing_lambda_function"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "PFDevelopmentSWXSOC_PIPELINEAllowExecutionFromSNSTopic-swxsoc-pipeline-reach"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.sf_allow_cloudwatch will be created
  + resource "aws_lambda_permission" "sf_allow_cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-swxsoc_pipeline_sdc_aws_sorting_lambda_function"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SFDevelopmentSWXSOC_PIPELINEAllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.sf_allow_incoming_bucket will be created
  + resource "aws_lambda_permission" "sf_allow_incoming_bucket" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-swxsoc_pipeline_sdc_aws_sorting_lambda_function"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SFDevelopmentSWXSOC_PIPELINEAllowExecutionFromS3Bucket"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.sdc_buckets["swxsoc-pipeline-incoming"] will be created
  + resource "aws_s3_bucket" "sdc_buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-swxsoc-pipeline-incoming"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all                    = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.sdc_buckets["swxsoc-pipeline-reach"] will be created
  + resource "aws_s3_bucket" "sdc_buckets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-swxsoc-pipeline-reach"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all                    = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # aws_s3_bucket_notification.pf_bucket_notification[0] will be created
  + resource "aws_s3_bucket_notification" "pf_bucket_notification" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + topic {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "raw"
          + id            = (known after apply)
          + topic_arn     = (known after apply)
        }
      + topic {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "l0"
          + id            = (known after apply)
          + topic_arn     = (known after apply)
        }
      + topic {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "l1"
          + id            = (known after apply)
          + topic_arn     = (known after apply)
        }
      + topic {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "l2"
          + id            = (known after apply)
          + topic_arn     = (known after apply)
        }
      + topic {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "l3"
          + id            = (known after apply)
          + topic_arn     = (known after apply)
        }
      + topic {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "ql"
          + id            = (known after apply)
          + topic_arn     = (known after apply)
        }
    }

  # aws_s3_bucket_versioning.sdc_buckets["swxsoc-pipeline-incoming"] will be created
  + resource "aws_s3_bucket_versioning" "sdc_buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_versioning.sdc_buckets["swxsoc-pipeline-reach"] will be created
  + resource "aws_s3_bucket_versioning" "sdc_buckets" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_secretsmanager_secret.rds_secret will be created
  + resource "aws_secretsmanager_secret" "rds_secret" {
      + arn                            = (known after apply)
      + description                    = "RDS Credentials"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "dev-swxsoc_pipeline-rds-credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all                       = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.secret will be created
  + resource "aws_secretsmanager_secret_version" "secret" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_security_group.lambda_sg will be created
  + resource "aws_security_group" "lambda_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-053871f23a6d6b927"
    }

  # aws_security_group.rds_sg will be created
  + resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-053871f23a6d6b927"
    }

  # aws_sns_topic.sns_topics["swxsoc-pipeline-reach"] will be created
  + resource "aws_sns_topic" "sns_topics" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "dev-swxsoc-pipeline-reach-sns-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sns:Publish"
                      + Condition = {
                          + ArnLike = {
                              + "aws:SourceArn" = "arn:aws:s3:::dev-swxsoc-pipeline-reach"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "arn:aws:sns:us-east-1:351967858401:dev-swxsoc-pipeline-reach-sns-topic"
                      + Sid       = "SNSPublishAccess-dev-swxsoc-pipeline-reach"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all                    = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.af_sns_topic_subscription["swxsoc-pipeline-reach"] will be created
  + resource "aws_sns_topic_subscription" "af_sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.pf_sns_topic_subscription["swxsoc-pipeline-reach"] will be created
  + resource "aws_sns_topic_subscription" "pf_sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sqs_queue.sqs_queue["swxsoc-pipeline-reach"] will be created
  + resource "aws_sqs_queue" "sqs_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "dev-swxsoc-pipeline-reach-sqs-queue"
      + name_prefix                       = (known after apply)
      + policy                            = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:SourceArn" = "arn:aws:sns:us-east-1:351967858401:dev-swxsoc-pipeline-reach-sns-topic"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sns.amazonaws.com"
                        }
                      + Resource  = "arn:aws:sqs:us-east-1:351967858401:dev-swxsoc-pipeline-reach-sqs-queue"
                    },
                  + {
                      + Action    = [
                          + "sqs:ReceiveMessage",
                          + "sqs:SendMessage",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "aws:SourceArn" = "arn:aws:sns:us-east-1:351967858401:dev-swxsoc-pipeline-reach-sns-topic"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sqs:us-east-1:351967858401:dev-swxsoc-pipeline-reach-sqs-queue"
                    },
                  + {
                      + Action    = [
                          + "sqs:ReceiveMessage",
                          + "sqs:SendMessage",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "aws:SourceArn" = "arn:aws:s3:::dev-swxsoc-pipeline-reach"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:sqs:us-east-1:351967858401:dev-swxsoc-pipeline-reach-sqs-queue"
                    },
                  + {
                      + Action    = [
                          + "sqs:GetQueueAttributes",
                          + "sqs:GetQueueUrl",
                          + "sqs:SendMessage",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:SourceArn" = "arn:aws:s3:::dev-swxsoc-pipeline-reach"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "arn:aws:sqs:us-east-1:351967858401:dev-swxsoc-pipeline-reach-sqs-queue"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags                              = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all                          = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_timestreamwrite_database.sdc_aws_timestream_db will be created
  + resource "aws_timestreamwrite_database" "sdc_aws_timestream_db" {
      + arn           = (known after apply)
      + database_name = "dev-swxsoc_pipeline_sdc_aws_logs"
      + id            = (known after apply)
      + kms_key_id    = (known after apply)
      + table_count   = (known after apply)
      + tags          = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all      = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
    }

  # aws_timestreamwrite_table.sdc_aws_timestream_table will be created
  + resource "aws_timestreamwrite_table" "sdc_aws_timestream_table" {
      + arn           = (known after apply)
      + database_name = "dev-swxsoc_pipeline_sdc_aws_logs"
      + id            = (known after apply)
      + table_name    = "dev-swxsoc_pipeline_sdc_aws_s3_bucket_log_table"
      + tags          = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }
      + tags_all      = {
          + "Environment" = "Development"
          + "Project"     = "swxsoc_pipeline"
          + "Purpose"     = "SWSOC Pipeline"
        }

      + magnetic_store_write_properties (known after apply)

      + retention_properties {
          + magnetic_store_retention_period_in_days = 30
          + memory_store_retention_period_in_hours  = 24
        }

      + schema (known after apply)
    }

  # random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 61 to add, 0 to change, 0 to destroy.
```